<template>
  <div class="about">
    <h1>Данное приложение было создано для практики на Vue 3  </h1>
    <h2>Что сделал и использовал :</h2>
    <h4>1)Vue-router 4</h4>
    <h4>2)Axios - для получения 100 постов с сервера</h4>
    <h4>3)Transition Group - анимации Vue при удалении или сортировки постов</h4>
    <h4>4)Mixins - создал переиспользуемый функционал для скрывания модальных окон</h4>
    <h4>5)Создал директиву V-focus - При открытии страницы фокус падает на поиск,
       при открытии модального окна на первую строку</h4>
    <h4>6)Создал библиотеку UI - My-Button, My-Dialog, My-Input, My-Select удобно для переиспользования в будущем</h4>
    <h4>7)Динамический биндинг классов и стилей - кликая по выбору страниц от 1 до 10, меняются классы у элементов и загружатся посты</h4>
    <h4>А так же :  Сортировку постов, поиск постов, создание постов</h4>

    
  </div>
</template>

<style>
.about {
  max-width: 1400px;
  margin: 0 100px;
  display: flex;
  flex-direction: column;
   align-items: flex-start;
}
</style>
